In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7.db

In [5]:
%sql select * from student

 * sqlite:///db_univ7.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [6]:
%sql select * from takes

 * sqlite:///db_univ7.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [3]:
%%sql
select name, course_id 
from  student, takes 
where student.ID = takes.ID;

 * sqlite:///db_univ7.db
Done.

[('Zhang', 'CS-101'),
 ('Zhang', 'CS-347'),
 ('Shankar', 'CS-101'),
 ('Shankar', 'CS-190'),
 ('Shankar', 'CS-315'),
 ('Shankar', 'CS-347'),
 ('Brandt', 'HIS-351'),
 ('Chavez', 'FIN-201'),
 ('Peltier', 'PHY-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-319'),
 ('Williams', 'CS-101'),
 ('Williams', 'CS-190'),
 ('Sanchez', 'MU-199'),
 ('Brown', 'CS-101'),
 ('Brown', 'CS-319'),
 ('Aoi', 'EE-181'),
 ('Bourikas', 'CS-101'),
 ('Bourikas', 'CS-315'),
 ('Tanaka', 'BIO-101'),
 ('Tanaka', 'BIO-301')]

In [65]:
%%sql select name, course_id 
from student natural join takes;

 * sqlite:///db_univ7.db
Done.

[('Zhang', 'CS-101'),
 ('Zhang', 'CS-347'),
 ('Shankar', 'CS-101'),
 ('Shankar', 'CS-190'),
 ('Shankar', 'CS-315'),
 ('Shankar', 'CS-347'),
 ('Brandt', 'HIS-351'),
 ('Chavez', 'FIN-201'),
 ('Peltier', 'PHY-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-319'),
 ('Williams', 'CS-101'),
 ('Williams', 'CS-190'),
 ('Sanchez', 'MU-199'),
 ('Brown', 'CS-101'),
 ('Brown', 'CS-319'),
 ('Aoi', 'EE-181'),
 ('Bourikas', 'CS-101'),
 ('Bourikas', 'CS-315'),
 ('Tanaka', 'BIO-101'),
 ('Tanaka', 'BIO-301')]

In [7]:
%%sql select name, title
from student natural join takes, course
where takes.course_id = course.course_id;

 * sqlite:///db_univ7.db
Done.

[('Zhang', 'Intro. to Computer Science'),
 ('Zhang', 'Database System Concepts'),
 ('Shankar', 'Intro. to Computer Science'),
 ('Shankar', 'Game Design'),
 ('Shankar', 'Robotics'),
 ('Shankar', 'Database System Concepts'),
 ('Brandt', 'World History'),
 ('Chavez', 'Investment Banking'),
 ('Peltier', 'Physical Principles'),
 ('Levy', 'Intro. to Computer Science'),
 ('Levy', 'Intro. to Computer Science'),
 ('Levy', 'Image Processing'),
 ('Williams', 'Intro. to Computer Science'),
 ('Williams', 'Game Design'),
 ('Sanchez', 'Music Video Production'),
 ('Brown', 'Intro. to Computer Science'),
 ('Brown', 'Image Processing'),
 ('Aoi', 'Intro. to Digital Systems'),
 ('Bourikas', 'Intro. to Computer Science'),
 ('Bourikas', 'Robotics'),
 ('Tanaka', 'Intro. to Biology'),
 ('Tanaka', 'Genetics')]

In [8]:
%%sql select name, title   
from student natural join takes natural join course;

 * sqlite:///db_univ7.db
Done.

[('Zhang', 'Intro. to Computer Science'),
 ('Zhang', 'Database System Concepts'),
 ('Shankar', 'Intro. to Computer Science'),
 ('Shankar', 'Game Design'),
 ('Shankar', 'Robotics'),
 ('Shankar', 'Database System Concepts'),
 ('Brandt', 'World History'),
 ('Chavez', 'Investment Banking'),
 ('Peltier', 'Physical Principles'),
 ('Williams', 'Intro. to Computer Science'),
 ('Williams', 'Game Design'),
 ('Sanchez', 'Music Video Production'),
 ('Brown', 'Intro. to Computer Science'),
 ('Brown', 'Image Processing'),
 ('Aoi', 'Intro. to Digital Systems'),
 ('Tanaka', 'Intro. to Biology'),
 ('Tanaka', 'Genetics')]

In [10]:
%%sql select name, dept_name   
from student;

 * sqlite:///db_univ7.db
Done.

[('Zhang', 'Comp. Sci.'),
 ('Shankar', 'Comp. Sci.'),
 ('Brandt', 'History'),
 ('Chavez', 'Finance'),
 ('Peltier', 'Physics'),
 ('Levy', 'Physics'),
 ('Williams', 'Comp. Sci.'),
 ('Sanchez', 'Music'),
 ('Snow', 'Physics'),
 ('Brown', 'Comp. Sci.'),
 ('Aoi', 'Elec. Eng.'),
 ('Bourikas', 'Elec. Eng.'),
 ('Tanaka', 'Biology')]

In [11]:
%%sql select *
from course;

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

In [16]:
%sql select * from prereq

 * sqlite:///db_univ7.db
Done.

[('BIO-301', 'BIO-101'),
 ('BIO-399', 'BIO-101'),
 ('CS-190', 'CS-101'),
 ('CS-315', 'CS-101'),
 ('CS-319', 'CS-101'),
 ('CS-347', 'CS-101'),
 ('EE-181', 'PHY-101')]

In [17]:
%sql select * from course natural left outer join prereq

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4, None),
 ('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4, None),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101'),
 ('FIN-201', 'Investment Banking', 'Finance', 3, None),
 ('HIS-351', 'World History', 'History', 3, None),
 ('MU-199', 'Music Video Production', 'Music', 3, None),
 ('PHY-101', 'Physical Principles', 'Physics', 4, None)]

In [18]:
%sql select * from course natural right outer join prereq

 * sqlite:///db_univ7.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: select * from course natural right outer join prereq]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [19]:
%%sql
select * from course natural join prereq

 * sqlite:///db_univ7.db
Done.

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101')]

In [24]:
%%sql
select * from course natural inner join prereq

 * sqlite:///db_univ7.db
Done.

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101')]

In [25]:
%%sql 
select * 
from course left outer join prereq on course.course_id = prereq.course_id

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4, None, None),
 ('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-399', 'BIO-101'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4, None, None),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-315', 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-319', 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-347', 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'EE-181', 'PHY-101'),
 ('FIN-201', 'Investment Banking', 'Finance', 3, None, None),
 ('HIS-351', 'World History', 'History', 3, None, None),
 ('MU-199', 'Music Video Production', 'Music', 3, None, None),
 ('PHY-101', 'Physical Principles', 'Physics', 4, None, None)]

In [26]:
%%sql 
select * 
from course left outer join prereq using (course_id)

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4, None),
 ('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4, None),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101'),
 ('FIN-201', 'Investment Banking', 'Finance', 3, None),
 ('HIS-351', 'World History', 'History', 3, None),
 ('MU-199', 'Music Video Production', 'Music', 3, None),
 ('PHY-101', 'Physical Principles', 'Physics', 4, None)]

In [3]:
%%sql 
create view faculty as 
select ID, name, dept_name
from instructor

 * sqlite:///db_univ7.db
Done.

[]

In [70]:
%sql select name from faculty where dept_name = 'Biology'

 * sqlite:///db_univ7.db
Done.

[('Crick',)]

In [22]:
%%sql
create view departments_total_salary(dept_name, total_salary) as
select dept_name, sum (salary)
from instructor
group by dept_name;

 * sqlite:///db_univ7.db
Done.

[]

In [71]:
%sql select * from  departments_total_salary

 * sqlite:///db_univ7.db
Done.

[('Biology', 72000),
 ('Comp. Sci.', 232000),
 ('Elec. Eng.', 80000),
 ('Finance', 170000),
 ('History', 122000),
 ('Music', 40000),
 ('Physics', 182000)]

In [31]:
%%sql
create view physics_fall_2017 as
select course.course_id, sec_id, building, room_number
from course, section
where course.course_id = section.course_id
and course.dept_name = 'Physics' and section.semester = 'Fall' and section.year = '2017'

 * sqlite:///db_univ7.db
Done.

[]

In [72]:
%sql select * from physics_fall_2017

 * sqlite:///db_univ7.db
Done.

[('PHY-101', '1', 'Watson', '100')]

In [33]:
%%sql
create view physics_fall_2017_watson as
select course_id, room_number from physics_fall_2017 where building='Watson'

 * sqlite:///db_univ7.db
Done.

[]

In [34]:
%sql select * from physics_fall_2017_watson

 * sqlite:///db_univ7.db
Done.

[('PHY-101', '100')]

In [4]:
%sql insert into faculty values ('30765', 'Green', 'Music');

 * sqlite:///db_univ7.db
(sqlite3.OperationalError) cannot modify faculty because it is a view
[SQL: insert into faculty values ('30765', 'Green', 'Music');]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [5]:
%sql insert into faculty values ('30765', 'Green', 'Music', null);

 * sqlite:///db_univ7.db
(sqlite3.OperationalError) cannot modify faculty because it is a view
[SQL: insert into faculty values ('30765', 'Green', 'Music', null);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [6]:
%sql select * from faculty

 * sqlite:///db_univ7.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.'),
 ('12121', 'Wu', 'Finance'),
 ('15151', 'Mozart', 'Music'),
 ('22222', 'Einstein', 'Physics'),
 ('32343', 'El Said', 'History'),
 ('33456', 'Gold', 'Physics'),
 ('45565', 'Katz', 'Comp. Sci.'),
 ('58583', 'Califieri', 'History'),
 ('76543', 'Singh', 'Finance'),
 ('76766', 'Crick', 'Biology'),
 ('83821', 'Brandt', 'Comp. Sci.'),
 ('98345', 'Kim', 'Elec. Eng.'),
 ('99998', 'Lee%', 'Biology'),
 ('99999', 'Lee2', 'Biology')]

In [7]:
%sql insert into instructor values ('30765','Green','Music',null)

 * sqlite:///db_univ7.db
1 rows affected.

[]

In [8]:
%sql select * from faculty

 * sqlite:///db_univ7.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.'),
 ('12121', 'Wu', 'Finance'),
 ('15151', 'Mozart', 'Music'),
 ('22222', 'Einstein', 'Physics'),
 ('32343', 'El Said', 'History'),
 ('33456', 'Gold', 'Physics'),
 ('45565', 'Katz', 'Comp. Sci.'),
 ('58583', 'Califieri', 'History'),
 ('76543', 'Singh', 'Finance'),
 ('76766', 'Crick', 'Biology'),
 ('83821', 'Brandt', 'Comp. Sci.'),
 ('98345', 'Kim', 'Elec. Eng.'),
 ('99998', 'Lee%', 'Biology'),
 ('99999', 'Lee2', 'Biology'),
 ('30765', 'Green', 'Music')]